lhzloveyyj/FOC/stm32f103_FOC/电流环/.pack/Keil/STM32F1xx_DFP.2.3.0/RTE_Driver/USBH_STM32F10x_cl.c
  return NULL;
}

/**
  \fn          bool USBH_CH_Disable (OTG_FS_HC *ptr_ch)
  \brief       Disable the Channel.
  \param[in]   ptr_ch   Pointer to the Channel
  \return      true = success, false = fail
*/
__INLINE static bool USBH_CH_Disable (OTG_FS_HC *ptr_ch) {
  uint32_t i;

  if (ptr_ch == 0U) { return false; }

  if ((ptr_ch->HCINT & OTG_FS_HCINTx_CHH) != 0U) { return true; }

  if ((ptr_ch->HCCHAR & OTG_FS_HCCHARx_CHENA) != 0U) {
    ptr_ch->HCINTMSK = 0U;
    osDelay(1U);
    if ((ptr_ch->HCINT & OTG_FS_HCINTx_NAK) != 0U) {
      ptr_ch->HCINT  =  0x7BBU;
      return true;
    }
    ptr_ch->HCINT  =  0x7BBU;
    ptr_ch->HCCHAR =  ptr_ch->HCCHAR | OTG_FS_HCCHARx_CHENA | OTG_FS_HCCHARx_CHDIS;
    for (i = 0U; i < 1000U; i++) {
      if ((ptr_ch->HCINT & OTG_FS_HCINTx_CHH) != 0U) {
        ptr_ch->HCINT = 0x7BBU;
        return true;
      }
    }
    return false;
  }

  return true;
}

/**
  \fn          bool USBH_HW_StartTransfer (PIPE_t *ptr_pipe, OTG_FS_HC *ptr_ch)
  \brief       Start transfer on Pipe.
  \param[in]   ptr_pipe Pointer to Pipe
  \param[in]   ptr_ch   Pointer to Channel
  \return      true = success, false = fail
*/
static bool USBH_HW_StartTransfer (PIPE_t *ptr_pipe, OTG_FS_HC *ptr_ch) {
  uint32_t           hcchar;
  uint32_t           hctsiz;
  uint32_t           hcintmsk;
  uint32_t           txsts;
  uint32_t           pckt_num;
  uint32_t           data_num;
  uint32_t           max_pckt_size;
  uint32_t           max_data;
  uint32_t           max_num_pckt;
  uint32_t           num_to_transfer;
  uint8_t           *ptr_src;
  volatile uint32_t *ptr_dest;
  uint16_t           cnt;
  uint8_t            out;

  if (ptr_pipe == 0U)                        { return false; }
  if (ptr_ch   == 0U)                        { return false; }
  if ((OTG->HPRT & OTG_FS_HPRT_PCSTS) == 0U) { return false; }

  hcchar   = ptr_ch->HCCHAR;                    // Read channel characteristics
  hctsiz   = ptr_ch->HCTSIZ;                    // Read channel size info
  hcintmsk = 0U;
  cnt      = 0U;
  out      = 0U;

  // Prepare transfer
                                                // Prepare HCCHAR register
  hcchar       &= (OTG_FS_HCCHARx_ODDFRM    |   // Keep ODDFRM
                   OTG_FS_HCCHARx_DAD_MSK   |   // Keep DAD
                   OTG_FS_HCCHARx_MCNT_MSK  |   // Keep MCNT
                   OTG_FS_HCCHARx_EPTYP_MSK |   // Keep EPTYP
                   OTG_FS_HCCHARx_LSDEV     |   // Keep LSDEV
                   OTG_FS_HCCHARx_EPNUM_MSK |   // Keep EPNUM
                   OTG_FS_HCCHARx_MPSIZ_MSK);   // Keep MPSIZ
  hctsiz       &=  OTG_FS_HCTSIZx_DPID_MSK;     // Keep DPID
  switch (ptr_pipe->packet & ARM_USBH_PACKET_TOKEN_Msk) {
    case ARM_USBH_PACKET_IN:
      hcchar   |=  OTG_FS_HCCHARx_EPDIR;
      hcintmsk  = (OTG_FS_HCINTMSKx_DTERRM  |
                   OTG_FS_HCINTMSKx_BBERRM  |
                   OTG_FS_HCINTMSKx_TXERRM  |
                   OTG_FS_HCINTMSKx_ACKM    |
                   OTG_FS_HCINTMSKx_NAKM    |
                   OTG_FS_HCINTMSKx_STALLM  |
                   OTG_FS_HCINTMSKx_XFRCM)  ;
      break;
    case ARM_USBH_PACKET_OUT:
      hcchar   &= ~OTG_FS_HCCHARx_EPDIR;
      hcintmsk  = (OTG_FS_HCINTMSKx_TXERRM  |
//                 OTG_FS_HCINTMSKx_ACKM    |         // After ACK there must be other relevant interrupt so ACK is ignorred
                   OTG_FS_HCINTMSKx_NAKM    |
                   OTG_FS_HCINTMSKx_STALLM  |
                   OTG_FS_HCINTMSKx_XFRCM)  ;
      out       =  1U;
      break;
    case ARM_USBH_PACKET_SETUP:
      hcchar   &= ~OTG_FS_HCCHARx_EPDIR;
      hcintmsk  = (OTG_FS_HCINTMSKx_TXERRM  |
                   OTG_FS_HCINTMSKx_XFRCM)  ;
      hctsiz   &= ~OTG_FS_HCTSIZx_DPID_MSK;
      hctsiz   |=  OTG_FS_HCTSIZx_DPID_MDATA;
      out       =  1U;
      break;
    default:
      return false;
  }

  num_to_transfer = ptr_pipe->num - ptr_pipe->num_transferred_total;
  switch (ptr_pipe->ep_type) {
    case ARM_USB_ENDPOINT_CONTROL:
    case ARM_USB_ENDPOINT_BULK:
      if (out != 0U) {
        txsts = OTG->HNPTXSTS;          // Read non-periodic FIFO status
      }
      break;
    case ARM_USB_ENDPOINT_ISOCHRONOUS:
    case ARM_USB_ENDPOINT_INTERRUPT:
      if (out != 0U) {
        txsts = OTG->HPTXSTS;           // Read non-periodic FIFO status
      }
      if ((OTG->HFNUM & 1U) != 0U) {
        hcchar &= ~OTG_FS_HCCHARx_ODDFRM;
      } else {
        hcchar |=  OTG_FS_HCCHARx_ODDFRM;
      }
      break;
  }
  if (out != 0U) {
    // For packet OUT/SETUP limit number of bytes to send to maximum FIFO size
    // and maximum number of packets
    max_pckt_size =  ptr_pipe->ep_max_packet_size;
    max_data      = (txsts & 0x0000FFFFU) <<  2;
    max_num_pckt  = (txsts & 0x00FF0000U) >> 16;
    if (num_to_transfer > max_data) {
      num_to_transfer = max_data;
    }
    data_num = num_to_transfer;
    for (pckt_num = 1; data_num > max_pckt_size; pckt_num++) {
      data_num -= max_pckt_size;
    }
    if (pckt_num > max_num_pckt) {
      pckt_num = max_num_pckt;
    }

    if (num_to_transfer > (pckt_num * max_pckt_size)) {
      num_to_transfer = pckt_num * max_pckt_size;
    }
    cnt = (num_to_transfer + 3U) / 4U;
  }

  hcchar &= ~OTG_FS_HCCHARx_CHDIS;
  hcchar |=  OTG_FS_HCCHARx_CHENA;

                                                  // Prepare HCTSIZ register
  switch (ptr_pipe->packet & ARM_USBH_PACKET_DATA_Msk) {
    case ARM_USBH_PACKET_DATA0:
      hctsiz   &= ~OTG_FS_HCTSIZx_DPID_MSK;
      hctsiz   |=  OTG_FS_HCTSIZx_DPID_DATA0;
      break;
    case ARM_USBH_PACKET_DATA1:
      hctsiz   &= ~OTG_FS_HCTSIZx_DPID_MSK;
      hctsiz   |=  OTG_FS_HCTSIZx_DPID_DATA1;
      break;
    default:
      break;
  }

                                                  // Prepare HCTSIZ register
  if (num_to_transfer != 0U) {                    // Normal packet
                                                  // Prepare PKTCNT field
    hctsiz |= ((num_to_transfer + ptr_pipe->ep_max_packet_size - 1U) / ptr_pipe->ep_max_packet_size) << 19;
    hctsiz |=   num_to_transfer;                  // Prepare XFRSIZ field
  } else {                                        // Zero length packet
    hctsiz |=   1U << 19;                         // Prepare PKTCNT field
    hctsiz |=   0U;                               // Prepare XFRSIZ field
  }

  if (cnt != 0U) {
    ptr_src  = ptr_pipe->data + ptr_pipe->num_transferred_total;
    ptr_dest = OTG_DFIFO[USBH_CH_GetIndexFromAddress (ptr_ch)];
  }
  if (out != 0U) {
    // For OUT/SETUP transfer num_transferring represents num of bytes to be sent
    ptr_pipe->num_transferring = num_to_transfer;
  } else {
    // For IN transfer num_transferring represents num of bytes received (handled in IRQ)
    ptr_pipe->num_transferring = 0U;
  }
  NVIC_DisableIRQ (OTG_FS_IRQn);                  // Disable OTG interrupt
  ptr_ch->HCINTMSK = hcintmsk;                    // Enable channel interrupts
  ptr_ch->HCTSIZ   = hctsiz;                      // Write ch transfer size
  ptr_ch->HCCHAR   = hcchar;                      // Write ch characteristics
  while (cnt != 0U) {                             // Load data
    *ptr_dest = *((__packed uint32_t *)ptr_src);
    ptr_src  += 4U;
    cnt--;
  }
  NVIC_EnableIRQ  (OTG_FS_IRQn);                  // Enable OTG interrupt

